/*
 Navicat Premium Data Transfer

 Source Server         : 127.0.0.1
 Source Server Type    : MySQL
 Source Server Version : 50713
 Source Host           : 127.0.0.1:3306
 Source Schema         : tbmp_intelligent

 Target Server Type    : MySQL
 Target Server Version : 50713
 File Encoding         : 65001

 Date: 17/07/2026 13:58:03
*/

SET NAMES utf8mb4;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
-- Table structure for config_target_manage
-- ----------------------------
DROP TABLE IF EXISTS `config_target_manage`;
CREATE TABLE `config_target_manage`  (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `ring_start` int(11) NOT NULL COMMENT '开始环号',
  `ring_end` int(11) NOT NULL COMMENT '结束环号',
  `speed_start` double(11, 2) NOT NULL COMMENT '规划开始速度(mm/min)',
  `speed_end` double(11, 2) NOT NULL COMMENT '规划结束速度(mm/min)',
  `torque_start` double(11, 2) NOT NULL COMMENT '预计开始扭矩(kNm)',
  `torque_end` double(11, 2) NOT NULL COMMENT '预计结束扭矩(kNm)',
  `thrust_start` double(11, 2) NOT NULL COMMENT '预计开始推力(KN)',
  `thrust_end` double(11, 2) NOT NULL COMMENT '预计结束推力(KN)',
  `oil_pressure_start` double(11, 2) NOT NULL COMMENT '分区开始油压(bar)',
  `oil_pressure_end` double(11, 2) NOT NULL COMMENT '分区结束油压(bar)',
  `oil_pressure_diff_start` double(11, 2) NOT NULL COMMENT '分区开始油压差(bar)',
  `oil_pressure_diff_end` double(11, 2) NOT NULL COMMENT '分区结束油压差(bar)',
  `horizontal_segment_pos` double(11, 2) NOT NULL COMMENT '水平中心目标位置(mm)',
  `vertical_segment_pos` double(11, 2) NOT NULL COMMENT '高程中心目标位置(mm)',
  `horizontal_pos` int(10) NOT NULL COMMENT '盾构姿态水平结束阶段类型(mm) 1切口 2盾尾',
  `horizontal_pos_dist` double(11, 2) NOT NULL COMMENT '盾构姿态水平结束阶段目标位置(mm)',
  `horizontal_head_offset_start` double(11, 2) NULL DEFAULT NULL COMMENT '盾构姿态水平切口偏差预估变化最小值(mm)',
  `horizontal_head_offset_end` double(11, 2) NULL DEFAULT NULL COMMENT '盾构姿态水平切口偏差预估变化最大值(mm)',
  `horizontal_head_pos_alert_start` double(11, 2) NULL DEFAULT NULL,
  `horizontal_head_pos_alert_end` double(11, 2) NULL DEFAULT NULL,
  `horizontal_tail_offset_start` double(11, 2) NULL DEFAULT NULL COMMENT '盾构姿态水平盾尾偏差预估变化最小值(mm)',
  `horizontal_tail_offset_end` double(11, 2) NULL DEFAULT NULL COMMENT '盾构姿态水平盾尾偏差预估变化最大值(mm)',
  `horizontal_tail_pos_alert_start` double(11, 2) NULL DEFAULT NULL,
  `horizontal_tail_pos_alert_end` double(11, 2) NULL DEFAULT NULL,
  `vertical_pos` int(10) NOT NULL COMMENT '盾构姿态高程结束阶段类型(mm) 1切口 2盾尾',
  `vertical_pos_dist` double(11, 2) NOT NULL COMMENT '盾构姿态高程结束阶段目标位置(mm)',
  `vertical_tail_offset_start` double(11, 2) NULL DEFAULT NULL COMMENT '盾构姿态高程切口偏差预估变化最小值(mm)',
  `vertical_tail_offset_end` double(11, 2) NULL DEFAULT NULL COMMENT '盾构姿态高程切口偏差预估变化最大值(mm)',
  `vertical_tail_pos_alert_start` double(11, 2) NULL DEFAULT NULL,
  `vertical_tail_pos_alert_end` double(11, 2) NULL DEFAULT NULL,
  `vertical_head_pos_alert_start` double(11, 2) NULL DEFAULT NULL,
  `vertical_head_pos_alert_end` double(11, 2) NULL DEFAULT NULL,
  `vertical_head_offset_start` double(11, 2) NULL DEFAULT NULL COMMENT '盾构姿态高程盾尾偏差预估变化最小值(mm)',
  `vertical_head_offset_end` double(11, 2) NULL DEFAULT NULL COMMENT '盾构姿态高程盾尾偏差预估变化最大值(mm)',
  `user_id` int(10) NOT NULL COMMENT '修改人用户表id',
  `create_date` datetime(0) NOT NULL COMMENT '修改时间',
  `update_date` datetime(0) NOT NULL COMMENT '更新时间',
  `update_user_id` int(10) NOT NULL COMMENT '更新人用户表id',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 23 CHARACTER SET = utf8 COLLATE = utf8_general_ci ROW_FORMAT = COMPACT;

-- ----------------------------
-- Records of config_target_manage
-- ----------------------------
INSERT INTO `config_target_manage` VALUES (1, 23, 27, 40.00, 60.00, 1345.00, 2018.00, 11452.00, 17178.00, 20.00, 250.00, -200.00, 200.00, 0.00, 0.00, 0, 0.00, -5.00, 7.00, -20.00, 22.00, -8.00, 4.00, -23.00, 19.00, 0, 0.00, -55.00, -25.00, -70.00, -10.00, -53.00, 7.00, -38.00, -8.00, 22, '2026-05-28 23:02:22', '2026-05-28 23:02:22', 22);
INSERT INTO `config_target_manage` VALUES (2, 40, 50, 30.00, 40.00, 1552.00, 3028.00, 10874.00, 25000.00, 20.00, 260.00, 0.00, 150.00, 0.00, 0.00, 1, -24.00, -29.00, -19.00, -44.00, -4.00, -30.00, -20.00, -45.00, -5.00, 1, -25.00, -28.00, -18.00, -43.00, -3.00, -45.00, -5.00, -30.00, -20.00, 1, '2026-06-01 10:08:20', '2026-06-01 10:47:36', 1);
INSERT INTO `config_target_manage` VALUES (3, 59, 68, 45.00, 55.00, 1456.00, 2884.00, 11261.00, 16892.00, 20.00, 260.00, 0.00, 150.00, 0.00, 0.00, 1, -15.00, -20.00, -10.00, -35.00, 5.00, -43.00, -33.00, -58.00, -18.00, 1, -29.00, -33.00, -23.00, -48.00, -8.00, -49.00, -9.00, -34.00, -24.00, 1, '2026-06-04 10:03:48', '2026-06-04 10:03:48', 1);
INSERT INTO `config_target_manage` VALUES (4, 62, 80, 45.00, 55.00, 1389.00, 2784.00, 11188.00, 16783.00, 20.00, 260.00, 0.00, 150.00, 0.00, 0.00, 1, -13.00, -18.00, -8.00, -33.00, 7.00, -33.00, -23.00, -48.00, -8.00, 1, -29.00, -34.00, -24.00, -49.00, -9.00, -49.00, -9.00, -34.00, -24.00, 1, '2026-06-04 17:41:22', '2026-06-04 17:41:22', 1);
INSERT INTO `config_target_manage` VALUES (5, 71, 90, 45.00, 55.00, 1371.00, 2756.00, 11072.00, 16608.00, 20.00, 260.00, 0.00, 150.00, 0.00, 0.00, 1, -21.00, -26.00, 2.00, -41.00, 17.00, -19.00, 9.00, -34.00, 24.00, 1, -29.00, -36.00, -25.00, -51.00, -10.00, -49.00, -8.00, -34.00, -23.00, 1, '2026-06-05 22:31:26', '2026-06-05 22:31:26', 1);
INSERT INTO `config_target_manage` VALUES (6, 75, 92, 45.00, 55.00, 1361.00, 2742.00, 11247.00, 16870.00, 20.00, 250.00, 0.00, 150.00, 0.00, 0.00, 1, -20.00, -25.00, -15.00, -40.00, 0.00, -45.00, -35.00, -60.00, -20.00, 1, -29.00, -28.00, -18.00, -43.00, -3.00, -49.00, -9.00, -34.00, -24.00, 1, '2026-06-06 12:21:24', '2026-06-06 12:21:24', 1);
INSERT INTO `config_target_manage` VALUES (7, 118, 132, 45.00, 55.00, 1656.00, 3184.00, 11307.00, 16960.00, 20.00, 260.00, 0.00, 160.00, 0.00, 0.00, 1, -20.00, -25.00, -15.00, -40.00, 0.00, -36.00, -26.00, -51.00, -11.00, 1, 0.00, -5.00, 7.00, -20.00, 22.00, -22.00, 20.00, -7.00, 5.00, 1, '2026-06-12 13:02:22', '2026-06-12 13:02:22', 1);
INSERT INTO `config_target_manage` VALUES (8, 127, 147, 45.00, 55.00, 1878.00, 3517.00, 12082.00, 18123.00, 20.00, 260.00, 0.00, 200.00, 0.00, 0.00, 1, -5.00, -10.00, 8.00, -25.00, 23.00, -9.00, 9.00, -24.00, 24.00, 1, -15.00, -47.00, -22.00, -62.00, -7.00, -50.00, 5.00, -35.00, -10.00, 1, '2026-06-29 10:25:10', '2026-06-29 10:25:10', 1);
INSERT INTO `config_target_manage` VALUES (9, 141, 160, 45.00, 50.00, 1942.00, 3613.00, 12608.00, 18913.00, 20.00, 260.00, 0.00, 200.00, 0.00, 0.00, 1, -10.00, -15.00, 4.00, -30.00, 19.00, -18.00, 0.00, -33.00, 15.00, 1, -20.00, -34.00, -9.00, -49.00, 6.00, -55.00, 0.00, -40.00, -15.00, 1, '2026-07-01 20:53:03', '2026-07-01 20:53:03', 1);
INSERT INTO `config_target_manage` VALUES (10, 150, 170, 45.00, 55.00, 1869.00, 3504.00, 12656.00, 18984.00, 20.00, 160.00, 0.00, 200.00, 0.00, 0.00, 1, 10.00, -11.00, 15.00, -26.00, 30.00, -20.00, 6.00, -35.00, 21.00, 1, -20.00, -57.00, -18.00, -72.00, -3.00, -69.00, 0.00, -54.00, -15.00, 1, '2026-07-04 12:04:23', '2026-07-04 12:04:23', 1);
INSERT INTO `config_target_manage` VALUES (11, 162, 180, 45.00, 55.00, 1918.00, 3577.00, 13106.00, 19659.00, 20.00, 250.00, 0.00, 200.00, 0.00, 0.00, 1, 10.00, -10.00, 15.00, -25.00, 30.00, -37.00, -12.00, -52.00, 3.00, 1, 20.00, -70.00, -29.00, -85.00, -14.00, -31.00, 40.00, -16.00, 25.00, 1, '2026-07-06 16:14:01', '2026-07-06 21:18:19', 1);
INSERT INTO `config_target_manage` VALUES (12, 164, 180, 33.00, 55.00, 1877.00, 3816.00, 13307.00, 19960.00, 20.00, 250.00, -200.00, 200.00, 0.00, 0.00, 1, 0.00, -5.00, 6.00, -20.00, 21.00, -34.00, -23.00, -49.00, -8.00, 1, 20.00, -64.00, -27.00, -79.00, -12.00, -27.00, 40.00, -12.00, 25.00, 23, '2026-07-06 23:21:44', '2026-07-06 23:21:44', 23);
INSERT INTO `config_target_manage` VALUES (13, 168, 178, 45.00, 55.00, 1846.00, 3469.00, 13228.00, 19842.00, 20.00, 250.00, 0.00, 200.00, 0.00, 0.00, 1, 0.00, -6.00, 5.00, -21.00, 20.00, -17.00, -6.00, -32.00, 9.00, 1, -20.00, -49.00, -24.00, -64.00, -9.00, -22.00, 33.00, -7.00, 18.00, 1, '2026-07-07 09:45:45', '2026-07-07 15:24:11', 1);
INSERT INTO `config_target_manage` VALUES (14, 167, 186, 45.00, 55.00, 1846.00, 3469.00, 13228.00, 19842.00, 20.00, 250.00, 0.00, 200.00, 0.00, 0.00, 1, 0.00, -5.00, 9.00, -20.00, 24.00, -23.00, -9.00, -38.00, 6.00, 1, 0.00, -58.00, -44.00, -73.00, -29.00, -20.00, 24.00, -5.00, 9.00, 1, '2026-07-07 10:03:36', '2026-07-07 10:03:36', 1);
INSERT INTO `config_target_manage` VALUES (15, 171, 186, 45.00, 55.00, 1886.00, 3529.00, 13535.00, 20302.00, 20.00, 250.00, 0.00, 200.00, 0.00, 0.00, 1, 0.00, -16.00, 5.00, -31.00, 20.00, -39.00, -18.00, -54.00, -3.00, 1, -20.00, -21.00, -4.00, -36.00, 11.00, -40.00, 7.00, -25.00, -8.00, 1, '2026-07-08 14:10:54', '2026-07-08 14:10:54', 1);
INSERT INTO `config_target_manage` VALUES (16, 179, 190, 45.00, 55.00, 1829.00, 3444.00, 13386.00, 20079.00, 20.00, 250.00, 0.00, 200.00, 0.00, 0.00, 1, 0.00, -9.00, 5.00, -24.00, 20.00, -23.00, -9.00, -38.00, 6.00, 1, -20.00, -63.00, -34.00, -78.00, -19.00, -59.00, 0.00, -44.00, -15.00, 1, '2026-07-09 10:37:22', '2026-07-09 10:37:22', 1);
INSERT INTO `config_target_manage` VALUES (17, 186, 200, 45.00, 55.00, 1855.00, 3482.00, 13871.00, 20806.00, 20.00, 250.00, 0.00, 200.00, 0.00, 0.00, 1, 0.00, -10.00, 5.00, -25.00, 20.00, -26.00, -11.00, -41.00, 4.00, 1, 0.00, -84.00, -58.00, -99.00, -43.00, -36.00, 20.00, -21.00, 5.00, 1, '2026-07-10 07:26:12', '2026-07-10 07:26:12', 1);
INSERT INTO `config_target_manage` VALUES (18, 188, 200, 45.00, 55.00, 1795.00, 3488.00, 13468.00, 20202.00, 20.00, 250.00, 0.00, 200.00, 0.00, 0.00, 1, 10.00, -13.00, 15.00, -28.00, 30.00, -41.00, -13.00, -56.00, 2.00, 1, 0.00, -71.00, -58.00, -86.00, -43.00, -23.00, 20.00, -8.00, 5.00, 1, '2026-07-10 12:23:00', '2026-07-10 12:23:00', 1);
INSERT INTO `config_target_manage` VALUES (19, 194, 210, 45.00, 55.00, 1904.00, 3556.00, 14248.00, 21373.00, 20.00, 250.00, 0.00, 200.00, 0.00, 0.00, 1, 15.00, 6.00, 20.00, -9.00, 35.00, -23.00, -9.00, -38.00, 6.00, 1, -5.00, -34.00, -17.00, -49.00, -2.00, -25.00, 22.00, -10.00, 7.00, 1, '2026-07-15 07:49:03', '2026-07-15 07:49:03', 1);
INSERT INTO `config_target_manage` VALUES (20, 199, 210, 33.00, 55.00, 1919.00, 3878.00, 13989.00, 20984.00, 20.00, 250.00, -200.00, 200.00, 0.00, 0.00, 1, 15.00, -7.00, 20.00, -22.00, 35.00, -26.00, 0.00, -41.00, 15.00, 1, 0.00, -27.00, -7.00, -42.00, 8.00, -30.00, 20.00, -15.00, 5.00, 23, '2026-07-15 18:05:28', '2026-07-15 18:05:51', 23);
INSERT INTO `config_target_manage` VALUES (21, 201, 219, 45.00, 55.00, 1833.00, 3450.00, 13864.00, 20797.00, 20.00, 250.00, 0.00, 200.00, 0.00, 0.00, 1, 20.00, -7.00, 15.00, -22.00, 30.00, -24.00, -2.00, -39.00, 13.00, 1, 5.00, -29.00, -5.00, -44.00, 10.00, -34.00, 20.00, -19.00, 5.00, 1, '2026-07-15 19:56:29', '2026-07-15 19:56:29', 1);
INSERT INTO `config_target_manage` VALUES (22, 208, 226, 55.00, 60.00, 1856.00, 3484.00, 13901.00, 20852.00, 20.00, 250.00, 0.00, 200.00, 0.00, 0.00, 1, 20.00, 12.00, 25.00, -3.00, 40.00, -8.00, 4.00, -23.00, 19.00, 1, 5.00, -31.00, -21.00, -46.00, -6.00, -15.00, 25.00, 0.00, 10.00, 1, '2026-07-16 11:27:02', '2026-07-16 11:30:02', 1);

SET FOREIGN_KEY_CHECKS = 1;
